_posts/2017-01-07-ltsp-pnp.html
---
layout:     post
title:      LTSP Server with Ubuntu 16.04
date:       2017-01-07
summary:    LTSP allows computers of a LAN to boot through network from a single server.
    One of the benefits of this is for example to cut down the
    administration and maintenance time of a classroom of computers
    (instead of installing, configuring and updating each of them we do it
    only once).
tags:       [ltsp ubuntu edubuntu]
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>LTSP Server with Ubuntu 16.04</title>
<!-- 2018-01-04 Thu 15:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dashamir Hoxha" />
</head>
<body>
<div id="content">
<h1 class="title">LTSP Server with Ubuntu 16.04</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Preparing the server</a></li>
<li><a href="#sec-3">3. Installing LTSP</a>
<ul>
<li><a href="#sec-3-1">3.1. Install packages</a></li>
<li><a href="#sec-3-2">3.2. Update kernels</a></li>
<li><a href="#sec-3-3">3.3. Create lts.conf</a></li>
<li><a href="#sec-3-4">3.4. Configure dnsmasq</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Creating the client image</a></li>
<li><a href="#sec-5">5. Installing Edubuntu programs</a></li>
<li><a href="#sec-6">6. Installing additional desktops</a></li>
<li><a href="#sec-7">7. Adding more users</a></li>
<li><a href="#sec-8">8. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
LTSP allows computers of a LAN to boot through network from a single
server.  One of the benefits of this is for example to cut down the
administration and maintenance time of a classroom of computers
(instead of installing, configuring and updating each of them, we do
it only once).
</p>

<p>
Some details about how it works are described in this article (in
case that you are curious):
<a href="https://ubuntuforums.org/showthread.php?t=2173749">https://ubuntuforums.org/showthread.php?t=2173749</a>
</p>

<p>
The <a href="https://www.edubuntu.org/documentation/ltsp-live">Edubuntu LTSP Live</a> is the most easy way to run a classroom with
Edubuntu LTSP.  But it is a bit outdated (based on ubuntu-14.04).
However it is not so difficult to build a LTSP server with the
latest Ubuntu desktop.
</p>

<p>
In my case, all the clients are decent machines with 2GB RAM, and
the server is just like them, so I decided to follow the <a href="https://help.ubuntu.com/community/UbuntuLTSP/ltsp-pnp">ltsp-pnp</a>
approach for fat clients, which is also the most easy to
implement. In this method the server is used as a template for the
clients, so that almost all the programs, configurations, users,
etc. that are installed on the server will be made available to the
clients as well (through the network).
</p>

<p>
Also, the gateway/router of the LAN provides automatic network
configuration (DHCP) as well, so I don't have to and I don't want to
introduce another DHCP server on the LAN (which may potentially be a
source of network problems).
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Preparing the server</h2>
<div class="outline-text-2" id="text-2">
<p>
I started by making a standard installation of <a href="https://linuxmint.com/download.php">LinuxMint 18.3 Xfce</a>
on the server PC, followed by some standard updates/customizations,
like:
</p>
<pre class="example">
apt-get update
apt-get upgrade
apt-get install chromium-browser
etc.
</pre>

<p>
I tried to install all the programs/tools that should be available
on the clients. In particular, one of them is <code>epoptes</code>, which
allows remote desktop control for the clients:
</p>
<pre class="example">
apt-get install epoptes epoptes-client
gpasswd -a ${SUDO_USER:-$USER} epoptes
</pre>

<p>
Then, I set a fixed IP address to the server by adding these lines
to <code>/etc/network/interfaces</code>:
</p>
<pre class="example">
auto enp0s8
iface enp0s8 inet static
    address 192.168.1.10
    netmask 255.255.255.0
    gateway 192.168.1.1
    dns-nameservers 8.8.8.8 8.8.4.4
</pre>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Installing LTSP</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Install packages</h3>
<div class="outline-text-3" id="text-3-1">
<p>
I installed the package <code>ltsp-server</code> (not
<code>ltsp-server-standalone</code>) and the other related packages:
</p>
<pre class="example">
apt-get --yes --install-recommends install \
    dnsmasq ltsp-server ltsp-client ldm-ubuntu-theme
</pre>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Update kernels</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
echo 'IPAPPEND=3' &gt;&gt; /etc/ltsp/update-kernels.conf
/usr/share/ltsp/update-kernels
</pre>
</div>
</div>


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Create lts.conf</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The command:
</p>
<pre class="example">
ltsp-config lts.conf
</pre>
<p>
creates the file <code>/var/lib/tftpboot/ltsp/i386/lts.conf</code> or
<code>/var/lib/tftpboot/ltsp/amd64/lts.conf</code> (depending on the
architecture of the server). I did not customize it.
</p>
</div>
</div>


<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Configure dnsmasq</h3>
<div class="outline-text-3" id="text-3-4">
<p>
The command:
</p>
<pre class="example">
ltsp-config dnsmasq
</pre>
<p>
creates the configuration file
<code>/etc/dnsmasq.d/ltsp-server-dnsmasq.conf</code>.
</p>

<p>
I had to fix a few things in it:
</p>
<ul class="org-ul">
<li>I don't want this server to give IP configuration (DHCP),
so I commented out this line:
<b><b>dhcp-range=192.168.67.20,192.168.67.250,8h</b></b>
</li>
<li>The line <b><b>port=0</b></b> breaks the name resolution (DNS) in Ubuntu-16.04,
so I commented it out as well.
</li>
</ul>

<p>
Then restart <code>dnsmasq</code>:
</p>
<pre class="example">
update-rc.d dnsmasq enable
service dnsmasq restart
</pre>

<p>
<b>Note:</b> If you don't have a DHCP server on your network, then
don't comment the <b>dhcp-range</b> above. But make sure that the fixed
IP (set in the previous section) and the DHCP range are in the
same network (for example <code>address 192.168.11.1</code> and
<code>dhcp-range=192.168.11.50,192.168.11.100</code>).
</p>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Creating the client image</h2>
<div class="outline-text-2" id="text-4">
<p>
The command:
</p>
<pre class="example">
ltsp-update-image --cleanup /
</pre>
<p>
generates the client image.  It may take some time.
</p>

<p>
When it is finished you can start booting clients from the network.
This is usually done by pressing F12 when the computer is just
powered on, but it may be different on different
computers. Sometimes you may need to enable booting from network on
the BIOS (it is usually called PXE booting).
</p>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Installing Edubuntu programs</h2>
<div class="outline-text-2" id="text-5">
<p>
Edubuntu programs can be installed like this:
</p>
<pre class="example">
apt-get install edubuntu-desktop
</pre>

<p>
Or like this:
</p>
<pre class="example">
apt-get install \
    ubuntu-edu-preschool \
    ubuntu-edu-primary \
    ubuntu-edu-secondary \
    ubuntu-edu-tertiary
</pre>

<p>
The first one installs everything about Edubuntu, including the
desktop, how it looks etc. The second method installs only the
additional educational software that usually comes with Edubuntu,
without changing the existing desktop etc. I prefer the second way
because it is more flexible (for example I would like to skip the
preschool tools, which are mainly games for small children).
</p>

<p>
Now that we have installed new packages, we have to update the image
as well, in order to make these changes available to the clients. It
is the same command as before:
</p>
<pre class="example">
ltsp-update-image --cleanup /
</pre>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Installing additional desktops</h2>
<div class="outline-text-2" id="text-6">
<p>
In Linux we can install several desktops and let the user choose
which one he prefers.  For example <a href="https://www.tecmint.com/install-mate-desktop-in-ubuntu-fedora/">this article</a> shows how to install
the MATE desktop. They can also be installed by installing the
packages <b>xubuntu-desktop</b>, <b>lubuntu-desktop</b>, <b>kubuntu-desktop</b> etc. Then
you need to update the client image again.
</p>

<p>
<b>Attention:</b> When you install another desktop, it is possible that it
may replace the Display Manager (the login window) with another
one. Make sure that you always keep <b>lightdm</b> as display manager, not
something else (for example <b>mdm</b>), because somehow it doesn't work
with <b>mdm.</b>
</p>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Adding more users</h2>
<div class="outline-text-2" id="text-7">
<p>
All the users of the server can also login from each of the clients.
So, to add more users we just add them on the server. No need to
update the client image on this case. Also, everything that the
users change is saved on the home directories on the server.
</p>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> References</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://ubuntuforums.org/showthread.php?t=2173749">https://ubuntuforums.org/showthread.php?t=2173749</a>
</li>
<li><a href="https://help.ubuntu.com/community/UbuntuLTSP/ltsp-pnp">https://help.ubuntu.com/community/UbuntuLTSP/ltsp-pnp</a>
</li>
<li><a href="https://help.ubuntu.com/community/UbuntuLTSP/FatClients">https://help.ubuntu.com/community/UbuntuLTSP/FatClients</a>
</li>
<li><a href="https://jonathancarter.org/2010/11/24/how-do-ltsp-fat-clients-work/">https://jonathancarter.org/2010/11/24/how-do-ltsp-fat-clients-work/</a>
</li>
<li><a href="http://www.m-opensolutions.com/?p=537">http://www.m-opensolutions.com/?p=537</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-01-07</p>
<p class="author">Author: Dashamir Hoxha</p>
<p class="date">Created: 2018-01-04 Thu 15:14</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"></p>
</div>
</body>
</html>
